#+latex_class: article
#+latex_class_options:
#+latex_header:
#+latex_header_extra:
#+description:
#+keywords:
#+subtitle:
#+latex_compiler: pdflatex
#+date: \today
#+author: Tim Ransom
#+STARTUP: hideblocks
#+PROPERTY: header-args:org :comments both :tangle-mode (identity #o444) :mkdirp yes


*** process logs

    This raw data was gathered from the backlog of sudo emails already in my gmail
    #+INCLUDE: "private-data.org"

  #+NAME: parse-sudo-logs
  #+begin_src python :tangle parse-sudo-db.py :results output :shebang "#!/usr/bin/env python3" :cache yes :noweb no-export

<<rawData>>

# an example entry:
#   /home/tsranso/.emacs.d/Maildir/tsranso/Automated/security information/cur/1586536789.200676_9487.tengen,U=1092:2,S:joey4.computing.clemson.edu : Feb 21 21:04:33 : etichen : user NOT in sudoers ; TTY=pts/13 ; PWD=/home/etichen/cpsc2100 ; USER=root ; COMMAND=/usr/bin/apt install sublime-text



import pprint
import re
from string import digits

logs = raw.split("\n")

def make_report (logs):
    def install_request_in_log(log):
        return 'install' in log["command"]
    install_logs = list(filter(install_request_in_log, logs))
    num_install_requests = len(install_logs)
    #print(install_logs)
    print(F"total logs:", (len(logs)))
    print(F"requests for installs:", (num_install_requests))
    print()

    def global_requested_packages(logs):
        def pull_command(log):
            command = ''
            try:
                command = log["command"].split("install")[1].strip()
            except:
                command = ''
            return command

        requested_packages = sorted(list(map(pull_command , logs)))
        for rp in requested_packages:
            if " " in rp:
                requested_packages.remove(rp)
                for p in rp.split(' '):
                    requested_packages.append(p)
        requested_packages = list(filter(None, requested_packages))
        package_counts = [[x,requested_packages.count(x)] for x in set(requested_packages)]

        print("Most requested logs, and how many times they were asked for:")
        print(sorted(package_counts, key=lambda x : x[1])[-6:])
        print()

    print("Most requested packages for all machines")
    global_requested_packages(logs)

    remove_digits = str.maketrans('', '', digits)
    for machine in set(map(lambda x : x["machine"].split(".")[0].translate(remove_digits), install_logs)):
        print("Most requested packages for machine class", machine)
        global_requested_packages(list(filter(lambda x : machine in x["machine"], install_logs)))

    def get_user_stats (logs):
        user_counts = [[user, len(list(filter(lambda x : x["user"] == user, logs)))] for user in set(map(lambda log : log["user"], logs))]
        print("Users with high sudo failures, maybe email them?")
        high_failure_users = list(filter(lambda user_entry : user_entry[1] > 10, sorted(user_counts, key=lambda x : x[1])))
        print(high_failure_users)
        
    get_user_stats(logs)

def processLog(log):
    splitLog = re.split(':|;', log)
    logDict = {}
    try:
        logDict = {
            'command' : splitLog[11].split('=')[1].lower(),
            'date' : F"{splitLog[3]}:{splitLog[4]}:{splitLog[5]}".strip(),
            'user' : splitLog[6].strip(),
            'machine' : splitLog[2].strip(),
            'pwd' : splitLog[9].split('=')[1].strip()
        }
        #        print('good dict')
    except:
        logDict = {}
        #        print('bad dict')
    return logDict

# processed = pool.map(processLog,logs)
# print('yay')
# pprint.pprint(processed[0:3])
processed = list()
for log in logs:
    #pprint.pprint(processLog(log))
    pl = processLog(log)
    if pl:
        processed.append(pl)
        #print(pl)
        #        print(f'{processLog(log)["user"]} {processLog(log)["command"]}')
# print(processed)
make_report(processed)

    
  #+end_src

  #+RESULTS[b4b940d8d124bbcafc286334120af946e2c72ed6]:
  #+begin_example
  total logs: 1244
  requests for installs: 416

  Most requested packages for all machines
  Most requested logs, and how many times they were asked for:
  [['xz-utils', 9], ['software-properties-common', 9], ['build-essential', 10], ['atom', 10], ['zip', 12], ['unzip', 22]]

  Most requested packages for machine class cerf
  Most requested logs, and how many times they were asked for:
  [['nodejs', 2], ['xbacklight', 2], ['simplescreenrecorder', 2], ['flex', 2], ['atom', 2], ['unzip', 2]]

  Most requested packages for machine class babbage
  Most requested logs, and how many times they were asked for:
  [['uncrustify', 1], ['cmake', 1], ['filezilla_3.39.0_x86_64-linux-gnu.tar.bz2', 1], ['libcurl4-openssl-dev', 1], ['software-properties-common', 2], ['linux-tools-common', 2]]

  Most requested packages for machine class melete
  Most requested logs, and how many times they were asked for:
  [['.run', 1]]

  Most requested packages for machine class www
  Most requested logs, and how many times they were asked for:
  [['vim', 1]]

  Most requested packages for machine class joey
  Most requested logs, and how many times they were asked for:
  [['build-essential', 5], ['zip', 5], ['software-properties-common', 5], ['valgrind', 6], ['er.run', 6], ['unzip', 15]]

  Most requested packages for machine class lab
  Most requested logs, and how many times they were asked for:
  [['--kivy', 1], ['python3-tk', 1], ['openvpn', 1], ['git-core', 2], ['-y', 2], ['zfsutils-linux', 2]]

  Most requested packages for machine class warriors
  Most requested logs, and how many times they were asked for:
  [['libncurses-dev', 1], ['samtools', 1]]

  Most requested packages for machine class minion
  Most requested logs, and how many times they were asked for:
  [['xscreensaver', 1], ['xscreensaver-gl-extra', 1], ['xscreensaver-data-extre', 1]]

  Most requested packages for machine class dragon
  Most requested logs, and how many times they were asked for:
  [['zip', 1], ['libav-tools', 1], ['sysinfo', 1], ['nvidia-440', 1], ['zip unzip', 1], ['kazam', 2]]

  Most requested packages for machine class titan
  Most requested logs, and how many times they were asked for:
  [['sox', 1], ['perf', 1]]

  Most requested packages for machine class dpa
  Most requested logs, and how many times they were asked for:
  [['dconf-tools', 1], ['libglfw3-dev', 1], ['build-essential', 1]]

  Most requested packages for machine class chuck
  Most requested logs, and how many times they were asked for:
  [['mbr', 1]]

  Most requested packages for machine class fibonacci
  Most requested logs, and how many times they were asked for:
  [['pulp', 1]]

  Most requested packages for machine class tutor
  Most requested logs, and how many times they were asked for:
  [['python3.6-dev', 1], ['python3.5', 1], ['python3.6-dev libmysqlclient-dev', 1], ['libmysqlclient-dev', 1], ['simplescreenrecorder', 1], ['shutter', 2]]

  Most requested packages for machine class newton
  Most requested logs, and how many times they were asked for:
  [['selectors', 1], ['chmod', 1], ['openvpn', 1], ['sshpass', 2], ['xz-utils', 2], ['slap', 2]]

  Most requested packages for machine class webapp
  Most requested logs, and how many times they were asked for:
  [['chmod', 1], ['ffmpeg', 1]]

  Most requested packages for machine class ada
  Most requested logs, and how many times they were asked for:
  [['virt-viewer', 2], ['python3-tk', 3], ['snapd', 3], ['atom', 4], ['xz-utils', 4], ['qemu', 5]]

  Most requested packages for machine class access
  Most requested logs, and how many times they were asked for:
  [['gcc-arm*', 3], ['gcc', 3], ['unzip', 3], ['gdb', 4], ['bind9', 5], ['zip', 5]]

  Users with high sudo failures, maybe email them?
<<list has been removed for privacy reasons>>
  #+end_example

** Prompt user for input
   #+begin_src C :tangle /tmp/prompt.c :comments both
#include <stdio.h>

int main(){
  char answer;
  printf("\nWould you like to play? Enter Y or N: \n");
  scanf(" %c", &answer);
  printf("\n answer is %c\n", answer);
  while (answer == 'Y'){

    printf("Success!");

    printf("\nDo you want to play again? Y or N: \n");

    scanf(" %c", &answer);
    printf("\n answer is %c\n", answer);

  }
  printf("GoodBye!");
  return 0;
}
   #+end_src

   #+begin_src sh :dir /tmp :results verbatim :comments both
gcc -o prompt prompt.c
./prompt <<< 'y'
printf '\n\n----------------------\n'
./prompt <<< 'n'
   #+end_src

   #+RESULTS:
   #+begin_example

   Would you like to play? Enter Y or N: 

    answer is y
   GoodBye!

   ----------------------

   Would you like to play? Enter Y or N: 

    answer is n
   GoodBye!
   #+end_example

** execute system command

   #+begin_src C :tangle /tmp/execute-program.c
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main () {
  char command[5];

  strcpy( command, "ls -l" );
  system(command);

  return(0);
} 
   #+end_src

   #+RESULTS:
   | total      | 628 |         |         |        |     |    |       |                        |
   | drwxr-xr-x |   2 | tsranso | tsranso |   4096 | Jun | 30 | 18:38 | _minted-proposal       |
   | -rw-r--r-- |   1 | tsranso | tsranso |    509 | Jun | 23 | 14:56 | process-monitoring.org |
   | -rw-r--r-- |   1 | tsranso | tsranso |  45862 | Jun | 30 | 18:38 | proposal.pdf           |
   | -rw-r--r-- |   1 | tsranso | tsranso |   5261 | Jun | 30 | 18:38 | proposal.tex           |
   | -rw-r--r-- |   1 | tsranso | tsranso | 576646 | Jul | 14 | 13:29 | sudo-plugin.org        |

